<template>
  <div>
    <div class="big-title mgb20 mgl">工作机会</div>
    <div class="content">
      <div class="item" v-for="(item, i) in list" :key="`item${i}`">
        <div class="title">{{item.title}}</div>
        <!-- <div class="zp-head">招聘人数：{{item.num}}</div>
        <div class="zp-head">招聘部门：{{item.section}}</div>
        <div class="zp-head">工作地点：{{item.place}}</div> -->
        <div class="detail">
          <div v-for="(item0, j) in item.detail" :key="`item0-${j}`">
            <div class="de-title">{{item0.label}}：</div>
            <div v-for="(item1, k) in item0.more" class="de-content" :key="`item1-${k}`">{{k + 1}}、{{item1}}</div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data () {
    return {
      list: [{
        title: '人事行政专员',
        num: '2',
        section: '研发二部',
        place: '深圳',
        detail: [{
          label: '职位要求',
          more: [
            '人力资源专业或行政管理专业，本科学历，具有工作经验。',
            '熟悉办公软件操作，熟悉特种设备法律法规及行业操作规程。具有一定的财税知识。'
          ]
        }, {
          label: '工作职责',
          more: [
            '负责招聘工作、员工入职手续办理及劳动合同的签订、续签与管理;',
            '负责制定及执行管理规章制度、各部门工作流程及绩效考核制度;',
            '负责考勤统计及工资绩效的核算;',
            '负责公司各部门上报计划文件的规范制作与整理；',
            '负责公司各类文件、合同、记录表的整理与档案管理工作；',
            '负责各部门员工行政后勤工作；',
            '负责员工企业制度培训工作，组织员工文体活动等;',
            '负责离职员工的善后处理工作，包括办公用品、工服、工具及公司物品归还情况等;',
            '负责经理交办的其他事务；'
          ]
        }]
      }, {
        title: '客户经理',
        num: '2',
        section: '研发二部',
        place: '深圳',
        detail: [{
          label: '职位要求',
          more: [
            '机电类专业或市场营销类专业，学历不限，具有电梯销售经验。',
            '熟悉特种设备招投标工作，熟练使用办公软件。',
            '具有项目合同谈判工作经验。'
          ]
        }, {
          label: '工作职责',
          more: [
            '负责电梯市场调查分析及市场业务开发；',
            '负责跟进分析电梯采购及电梯维保服务招标信息并制订销售计划；',
            '负责制作优质有效的投标文书材料并跟进投标工作；',
            '负责洽谈合同条款并组织合同评审；',
            '负责跟进电梯销售款项回收进度；',
            '负责走访客户，处理客户投诉；',
            '负责经理交办的其他事务；'
          ]
        }]
      }, {
        title: '维修员',
        num: '2',
        section: '研发二部',
        place: '深圳',
        detail: [{
          label: '职位要求',
          more: [
            '机电类专业，中技以上学历，持有电气类证书或电梯操作上岗证。',
            '熟练使用电梯维修专用设备，检查、判断并维修电梯基本故障问题。',
            '具有日立、三菱、蒂森、奥的斯等电梯维修工作经验，熟悉各类电梯配件及图纸，能解决电梯基本故障维修工作。'
          ]
        }, {
          label: '工作职责',
          more: [
            '负责实施电梯检修及维修安排，并做好相应的记录；',
            '负责向上级汇报电梯故障问题并提供维修方案；',
            '负责规范实施零星维修及大修工程并做好相应的记录；',
            '有驻场任务的，协助维保部门做好日常巡检维护工作；',
            '无驻场任务的，保持手机通讯正常，24小时待命提供急修服务；',
            '及时跟进甲方维修服务记录确认工作；',
            '负责电梯作业及电梯使用安全宣传；'
          ]
        }]
      }, {
        title: '维修组长',
        num: '2',
        section: '研发二部',
        place: '深圳',
        detail: [{
          label: '职位要求',
          more: [
            '机电类专业，中技以上学历，持有电梯操作上岗证。',
            '熟练使用电梯维修专用设备，检查、判断并维修电梯基本故障问题。',
            '具有日立、三菱、蒂森、奥的斯等电梯维保工作经验，熟悉各类电梯配件，能解决应对各种电梯急修大修工作。'
          ]
        }, {
          label: '工作职责',
          more: [
            '及时响应电梯突发故障问题，告知现场物业人员采取应急措施，迅速到场排除故障及跟踪；',
            '负责现场急修调度工作，跟进并汇报维修工程实施情况及恢复情况；',
            '负责反馈电梯故障问题，并根据实际情况制作维修计划上报审批；',
            '负责安排人员实施零星维修及大修工程，跟踪维修进度并上报；',
            '负责编制维修配件计划，调研多家供货厂家并联系售后服务。',
            '负责管理项目现场配件使用回收、技术资料及维修设备工具；',
            '无驻场任务的，保持手机通讯正常，24小时待命提供急修服务；',
            '负责电梯使用安全宣传，组织对电梯设备事故进行调查和处理，到现场了解和听取汇报，分析事故原因、制定解决办法和改进措施；',
            '负责跟进甲方关于维修服务确认工作及评价管理；',
            '负责维修作业的人身、设备、环境安全管理及培训；'
          ]
        }]
      }, {
        title: '维保组长',
        num: '2',
        section: '研发二部',
        place: '深圳',
        detail: [{
          label: '职位要求',
          more: [
            '机电类专业，中技以上学历，持有电梯操作上岗证。',
            '熟练使用电梯维修专用设备，检查、判断并维修电梯基本故障问题。',
            '具有日立、三菱、蒂森、奥的斯等电梯维保工作经验，能发现电梯潜在风险问题。'
          ]
        }, {
          label: '工作职责',
          more: [
            '负责项目电梯设备的接管验收及入场工作安排；',
            '负责项目现场联系调度工作，独立解决现场突发问题；',
            '负责建立健全项目电梯设备档案；',
            '负责管理区域项目维保合同、技术资料及维保工具；',
            '根据电梯设备现状和以往检修记录，编制电梯设备年、季、月保养计划，上报相关部门审批；',
            '负责安排人员实施电梯设备及附属设施的日常检修及保养计划；',
            '负责电梯设备的日常保养记录跟踪，及时上报电梯潜在风险问题；',
            '负责电梯年检、抽检事宜；',
            '负责电梯使用安全宣传，组织对电梯设备事故进行调查和处理，到现场了解和听取汇报，分析事故原因、制定解决办法和改进措施；',
            '负责跟进甲方关于维保服务评价管理，维护甲方关系；',
            '负责维保作业的人身、设备、环境安全管理及培训；'
          ]
        }]
      }]
    }
  }
}
</script>
<style lang="less" scoped>
.content{
  padding: 20px 0;
  overflow: hidden;
  .item{
    padding: 40px;
    box-sizing: border-box;
    width: 48%;
    float: left;
    border: 1px solid #eee;
    border-radius: 10px;
    margin: 10px;
    box-shadow: 0 0 10px #ccc;
    .title{
      font-size: 24px;
      color: #d82f2f;
      margin-bottom: 30px;
    }
    .zp-head{
      font-size: 14px;
      color: #666;
      line-height: 24px;
    }
    .detail{
      margin-top: 30px;
      height: 250px;
      overflow-y: auto;
      &::-webkit-scrollbar {
        width: 6px;
        height: 6px;
      }
      /*滚动条里面小方块*/
      &::-webkit-scrollbar-thumb {
        border-radius: 10px;
        background: #ccc;
        opacity: 0.5;
      }
      .de-title{
        font-size: 16px;
        color: #333;
        font-weight: bold;
        margin: 10px 0;
      }
      .de-content{
        font-size: 14px;
        color: #666;
        line-height: 24px;
      }
    }
  }
}
</style>
